app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:create] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test4"], ["body", "test"], ["created_at", "2021-10-17 05:17:52.828634"], ["updated_at", "2021-10-17 05:17:52.828634"]]
SELECT "books".* FROM "books"